----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 768, 32, 32]         393,984
         LayerNorm-2            [-1, 1024, 768]           1,536
            Linear-3           [-1, 1024, 2304]       1,769,472
           Dropout-4        [-1, 8, 1024, 1024]               0
            Linear-5            [-1, 1024, 768]         590,592
MultiHeadAttention-6            [-1, 1024, 768]               0
         LayerNorm-7            [-1, 1024, 768]           1,536
            Linear-8           [-1, 1024, 3072]       2,362,368
              GELU-9           [-1, 1024, 3072]               0
          Dropout-10           [-1, 1024, 3072]               0
           Linear-11            [-1, 1024, 768]       2,360,064
          Dropout-12            [-1, 1024, 768]               0
      MaxViTBlock-13            [-1, 1024, 768]               0
        LayerNorm-14            [-1, 1024, 768]           1,536
           Linear-15           [-1, 1024, 2304]       1,769,472
          Dropout-16        [-1, 8, 1024, 1024]               0
           Linear-17            [-1, 1024, 768]         590,592
MultiHeadAttention-18            [-1, 1024, 768]               0
        LayerNorm-19            [-1, 1024, 768]           1,536
           Linear-20           [-1, 1024, 3072]       2,362,368
             GELU-21           [-1, 1024, 3072]               0
          Dropout-22           [-1, 1024, 3072]               0
           Linear-23            [-1, 1024, 768]       2,360,064
          Dropout-24            [-1, 1024, 768]               0
      MaxViTBlock-25            [-1, 1024, 768]               0
        LayerNorm-26            [-1, 1024, 768]           1,536
           Linear-27           [-1, 1024, 2304]       1,769,472
          Dropout-28        [-1, 8, 1024, 1024]               0
           Linear-29            [-1, 1024, 768]         590,592
MultiHeadAttention-30            [-1, 1024, 768]               0
        LayerNorm-31            [-1, 1024, 768]           1,536
           Linear-32           [-1, 1024, 3072]       2,362,368
             GELU-33           [-1, 1024, 3072]               0
          Dropout-34           [-1, 1024, 3072]               0
           Linear-35            [-1, 1024, 768]       2,360,064
          Dropout-36            [-1, 1024, 768]               0
      MaxViTBlock-37            [-1, 1024, 768]               0
        LayerNorm-38            [-1, 1024, 768]           1,536
           Linear-39           [-1, 1024, 2304]       1,769,472
          Dropout-40        [-1, 8, 1024, 1024]               0
           Linear-41            [-1, 1024, 768]         590,592
MultiHeadAttention-42            [-1, 1024, 768]               0
        LayerNorm-43            [-1, 1024, 768]           1,536
           Linear-44           [-1, 1024, 3072]       2,362,368
             GELU-45           [-1, 1024, 3072]               0
          Dropout-46           [-1, 1024, 3072]               0
           Linear-47            [-1, 1024, 768]       2,360,064
          Dropout-48            [-1, 1024, 768]               0
      MaxViTBlock-49            [-1, 1024, 768]               0
           Conv2d-50          [-1, 512, 32, 32]         393,728
================================================================
Total params: 29,129,984
Trainable params: 29,129,984
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 2.00
Forward/backward pass size (MB): 794.00
Params size (MB): 111.12
Estimated Total Size (MB): 907.12
----------------------------------------------------------------
