----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 512, 512]           1,792
       BatchNorm2d-2         [-1, 64, 512, 512]             128
              GELU-3         [-1, 64, 512, 512]               0
            Conv2d-4         [-1, 64, 512, 512]          36,928
       BatchNorm2d-5         [-1, 64, 512, 512]             128
              GELU-6         [-1, 64, 512, 512]               0
         MaxPool2d-7         [-1, 64, 256, 256]               0
      EncoderBlock-8  [[-1, 64, 256, 256], [-1, 64, 512, 512]]               0
            Conv2d-9        [-1, 128, 256, 256]          73,856
      BatchNorm2d-10        [-1, 128, 256, 256]             256
             GELU-11        [-1, 128, 256, 256]               0
           Conv2d-12        [-1, 128, 256, 256]         147,584
      BatchNorm2d-13        [-1, 128, 256, 256]             256
             GELU-14        [-1, 128, 256, 256]               0
        MaxPool2d-15        [-1, 128, 128, 128]               0
     EncoderBlock-16  [[-1, 128, 128, 128], [-1, 128, 256, 256]]               0
           Conv2d-17        [-1, 256, 128, 128]         295,168
      BatchNorm2d-18        [-1, 256, 128, 128]             512
             GELU-19        [-1, 256, 128, 128]               0
           Conv2d-20        [-1, 256, 128, 128]         590,080
      BatchNorm2d-21        [-1, 256, 128, 128]             512
             GELU-22        [-1, 256, 128, 128]               0
        MaxPool2d-23          [-1, 256, 64, 64]               0
     EncoderBlock-24  [[-1, 256, 64, 64], [-1, 256, 128, 128]]               0
           Conv2d-25          [-1, 512, 64, 64]       1,180,160
      BatchNorm2d-26          [-1, 512, 64, 64]           1,024
             GELU-27          [-1, 512, 64, 64]               0
           Conv2d-28          [-1, 512, 64, 64]       2,359,808
      BatchNorm2d-29          [-1, 512, 64, 64]           1,024
             GELU-30          [-1, 512, 64, 64]               0
        MaxPool2d-31          [-1, 512, 32, 32]               0
     EncoderBlock-32  [[-1, 512, 32, 32], [-1, 512, 64, 64]]               0
           Conv2d-33          [-1, 256, 64, 64]           4,352
             GELU-34          [-1, 256, 64, 64]               0
           Conv2d-35          [-1, 512, 64, 64]         131,584
           Conv2d-36          [-1, 512, 32, 32]         524,800
          Sigmoid-37          [-1, 512, 32, 32]               0
AdaptiveWeightBlender-38          [-1, 512, 32, 32]               0
           Conv2d-39          [-1, 768, 32, 32]         393,984
           Conv2d-40          [-1, 768, 32, 32]         590,592
        LayerNorm-41            [-1, 1024, 768]           1,536
           Linear-42           [-1, 1024, 2304]       1,769,472
          Dropout-43        [-1, 8, 1024, 1024]               0
           Linear-44            [-1, 1024, 768]         590,592
MultiHeadAttention-45            [-1, 1024, 768]               0
        LayerNorm-46            [-1, 1024, 768]           1,536
           Linear-47           [-1, 1024, 3072]       2,362,368
             GELU-48           [-1, 1024, 3072]               0
          Dropout-49           [-1, 1024, 3072]               0
           Linear-50            [-1, 1024, 768]       2,360,064
          Dropout-51            [-1, 1024, 768]               0
      MaxViTBlock-52            [-1, 1024, 768]               0
        LayerNorm-53            [-1, 1024, 768]           1,536
           Linear-54           [-1, 1024, 2304]       1,769,472
          Dropout-55        [-1, 8, 1024, 1024]               0
           Linear-56            [-1, 1024, 768]         590,592
MultiHeadAttention-57            [-1, 1024, 768]               0
        LayerNorm-58            [-1, 1024, 768]           1,536
           Linear-59           [-1, 1024, 3072]       2,362,368
             GELU-60           [-1, 1024, 3072]               0
          Dropout-61           [-1, 1024, 3072]               0
           Linear-62            [-1, 1024, 768]       2,360,064
          Dropout-63            [-1, 1024, 768]               0
      MaxViTBlock-64            [-1, 1024, 768]               0
        LayerNorm-65            [-1, 1024, 768]           1,536
           Linear-66           [-1, 1024, 2304]       1,769,472
          Dropout-67        [-1, 8, 1024, 1024]               0
           Linear-68            [-1, 1024, 768]         590,592
MultiHeadAttention-69            [-1, 1024, 768]               0
        LayerNorm-70            [-1, 1024, 768]           1,536
           Linear-71           [-1, 1024, 3072]       2,362,368
             GELU-72           [-1, 1024, 3072]               0
          Dropout-73           [-1, 1024, 3072]               0
           Linear-74            [-1, 1024, 768]       2,360,064
          Dropout-75            [-1, 1024, 768]               0
      MaxViTBlock-76            [-1, 1024, 768]               0
        LayerNorm-77            [-1, 1024, 768]           1,536
           Linear-78           [-1, 1024, 2304]       1,769,472
          Dropout-79        [-1, 8, 1024, 1024]               0
           Linear-80            [-1, 1024, 768]         590,592
MultiHeadAttention-81            [-1, 1024, 768]               0
        LayerNorm-82            [-1, 1024, 768]           1,536
           Linear-83           [-1, 1024, 3072]       2,362,368
             GELU-84           [-1, 1024, 3072]               0
          Dropout-85           [-1, 1024, 3072]               0
           Linear-86            [-1, 1024, 768]       2,360,064
          Dropout-87            [-1, 1024, 768]               0
      MaxViTBlock-88            [-1, 1024, 768]               0
           Conv2d-89          [-1, 768, 32, 32]         590,592
           MaxViT-90          [-1, 768, 32, 32]               0
           Conv2d-91          [-1, 512, 32, 32]         393,728
  ConvTranspose2d-92          [-1, 256, 64, 64]         524,544
           Conv2d-93          [-1, 256, 64, 64]       1,769,728
      BatchNorm2d-94          [-1, 256, 64, 64]             512
             GELU-95          [-1, 256, 64, 64]               0
           Conv2d-96          [-1, 256, 64, 64]         590,080
      BatchNorm2d-97          [-1, 256, 64, 64]             512
             GELU-98          [-1, 256, 64, 64]               0
     DecoderBlock-99          [-1, 256, 64, 64]               0
 ConvTranspose2d-100        [-1, 128, 128, 128]         131,200
          Conv2d-101        [-1, 128, 128, 128]         442,496
     BatchNorm2d-102        [-1, 128, 128, 128]             256
            GELU-103        [-1, 128, 128, 128]               0
          Conv2d-104        [-1, 128, 128, 128]         147,584
     BatchNorm2d-105        [-1, 128, 128, 128]             256
            GELU-106        [-1, 128, 128, 128]               0
    DecoderBlock-107        [-1, 128, 128, 128]               0
 ConvTranspose2d-108         [-1, 64, 256, 256]          32,832
          Conv2d-109         [-1, 64, 256, 256]         110,656
     BatchNorm2d-110         [-1, 64, 256, 256]             128
            GELU-111         [-1, 64, 256, 256]               0
          Conv2d-112         [-1, 64, 256, 256]          36,928
     BatchNorm2d-113         [-1, 64, 256, 256]             128
            GELU-114         [-1, 64, 256, 256]               0
    DecoderBlock-115         [-1, 64, 256, 256]               0
          Conv2d-116          [-1, 3, 256, 256]             195
         Sigmoid-117          [-1, 3, 256, 256]               0
================================================================
Total params: 39,449,155
Trainable params: 39,449,155
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 196608.00
Forward/backward pass size (MB): 713028873.00
Params size (MB): 150.49
Estimated Total Size (MB): 713225631.49
----------------------------------------------------------------
